src/main/java/com/amdocs/halo/automation/xmls/Sarea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderEstablishment.ocxGenericServices.services.amdocs.com">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1">
            <wsse:Username>OMS</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <cus:createProductOrderForNewProduct>
         <createProductOrderForNewProductRequest>
            <salesChannel>SA</salesChannel>
            <sourceSystem>SOC</sourceSystem>
            <options>
               <confirmationChecksApproved>true</confirmationChecksApproved>
            </options>
            <order>
               <customer>
                  <customerId>000000000</customerId>
                  <customerName>ATT USA</customerName>
               </customer>
               <productOfferings>
                  <productOfferingId>5609805</productOfferingId>
                  <topLevelProducts>
                     <associationSpec>
                        <productSpecsId>1981</productSpecsId>
                     </associationSpec>
                     <orderItem>
                        <contacts>
                           <contactType>CUS</contactType>
                           <email>bm995j@att.com</email>
                           <firstName>Bhausahebssssss</firstName>
                           <landLinePhone>1234567436</landLinePhone>
                           <lastName>Muglessssss</lastName>
                        </contacts>
                        <orderActionType>PR</orderActionType>
                        <orderItemAttributes>
                           <aosteOrderNumber>22</aosteOrderNumber>
                           <espNggniOrderNumber>566</espNggniOrderNumber>
                           <sareaNggniOrderNumber>11</sareaNggniOrderNumber>
                           <!--<orderActionPurpose>SEVCAM</orderActionPurpose>-->
                        </orderItemAttributes>
                        <serviceAdddress>
                           <houseNumber>555555</houseNumber>
                           <city>Pune</city>
                           <country>India</country>
                           <isoCountryCode>IN</isoCountryCode>
                           <streetName>University road</streetName>
                           <zipCode>411003</zipCode>
                        </serviceAdddress>
                        <serviceRequiredDate>2021-01-22T16:00:17.432-04:00</serviceRequiredDate>
                     </orderItem>
                     <topLevelProduct>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>EVCA</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>baseServiceType</attributeCode>
                              </characteristicDefinition>
                              <value>SAREA</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>cosCategory</attributeCode>
                              </characteristicDefinition>
                              <value>GOS</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>EVCID</attributeCode>
                              </characteristicDefinition>
                              <value>SR/KUGN/000003/ATI</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CIRSpeed</attributeCode>
                              </characteristicDefinition>
                              <value>20</value>
                           </characteristicValues>
                        </containedProducts>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>BPORT</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>bearerCktId</attributeCode>
                              </characteristicDefinition>
                              <value>.MQYF.100509..ATI.</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>tagMode</attributeCode>
                              </characteristicDefinition>
                              <value>DOUBLE</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>sVlanTag</attributeCode>
                              </characteristicDefinition>
                              <value>807</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CVLANTAG</attributeCode>
                              </characteristicDefinition>
                              <value>231</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>popClli</attributeCode>
                              </characteristicDefinition>
                              <value>LONDENEL</value>
                           </characteristicValues>
                        </containedProducts>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>CPORT</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>interconnectType</attributeCode>
                              </characteristicDefinition>
                              <value>SHARED</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>poolId</attributeCode>
                              </characteristicDefinition>
                              <value>pool1234</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>tagMode</attributeCode>
                              </characteristicDefinition>
                              <value>SINGLE</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>sVlanTag</attributeCode>
                              </characteristicDefinition>
                              <value>921</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CVLANTAG</attributeCode>
                              </characteristicDefinition>
                              <value>165</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>popClli</attributeCode>
                              </characteristicDefinition>
                              <value>GBLOND20152</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>PhysicalPortInterface</attributeCode>
                              </characteristicDefinition>
                              <value>100000 Base MM</value>
                           </characteristicValues>
                           <!--<characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>jurisdiction</attributeCode>
                              </characteristicDefinition>
                              <value>Interstate</value>
                           </characteristicValues>-->
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>assignTag</attributeCode>
                              </characteristicDefinition>
                              <value>ESP</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>subRate</attributeCode>
                              </characteristicDefinition>
                              <value/>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>multiVlan</attributeCode>
                              </characteristicDefinition>
                              <value/>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ipMtu</attributeCode>
                              </characteristicDefinition>
                              <value></value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ipMtuSize</attributeCode>
                              </characteristicDefinition>
                              <value>4470</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>multiCast</attributeCode>
                              </characteristicDefinition>
                              <value>N</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>sareaEvcInformation</attributeCode>
                              </characteristicDefinition>
                              <value>sarea</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>serviceHours</attributeCode>
                              </characteristicDefinition>
                              <value>premium</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>tieDownInformation</attributeCode>
                              </characteristicDefinition>
                              <value>928</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>portId</attributeCode>
                              </characteristicDefinition>
                              <value>1.19</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ptnii</attributeCode>
                              </characteristicDefinition>
                              <value>KJIOUREFSFDT</value>
                           </characteristicValues>
                        </containedProducts>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>ESPI</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>espCollectorCktId</attributeCode>
                              </characteristicDefinition>
                              <value>POEUYEDH10</value>
                           </characteristicValues>
                           <!--<characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>espName</attributeCode>
                              </characteristicDefinition>
                              <value/>
                           </characteristicValues>-->
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>espCIRSpeed</attributeCode>
                              </characteristicDefinition>
                              <value>100</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ituCode</attributeCode>
                              </characteristicDefinition>
                              <value>BTOPEN</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>espEvcCktId</attributeCode>
                              </characteristicDefinition>
                              <value>NS56-Supp</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>productEntryId</attributeCode>
                              </characteristicDefinition>
                              <value>PEID1336</value>
                           </characteristicValues>
                        </containedProducts>
                     </topLevelProduct>
                  </topLevelProducts>
               </productOfferings>
               <startOrderingProcess>true</startOrderingProcess>
               <userId>gp1650</userId>
            </order>
         </createProductOrderForNewProductRequest>
      </cus:createProductOrderForNewProduct>
   </soapenv:Body>
</soapenv:Envelope>